In [9]:
import pandas as pd  
import numpy as np

In [49]:
info = {'x' : 0., 'y' : 1., 'z' : 2.} 
print(info)
a = pd.Series(data=info, dtype='float64', name='Dictionary')
print(a)

{'x': 0.0, 'y': 1.0, 'z': 2.0}
x    0.0
y    1.0
z    2.0
Name: Dictionary, dtype: float64

In [29]:
x = ['Python', 'Pandas', 'Scipy']  
cols = ['Name']
# Calling DataFrame constructor on list  
df = pd.DataFrame(x, columns = cols)  
print(df)

     Name
0  Python
1  Pandas
2   Scipy

In [55]:
x = pd.Series(4, index=[0, 1, 2, 3])  
print (x)

0    4
1    4
2    4
3    4
dtype: int64

In [69]:
x = {'ID' :[101, 102, 103],'Department' :['B.Sc','B.Tech','M.Tech',]} 
  
# Calling DataFrame constructor on list  
df = pd.DataFrame(x)  
print(df)  
df.loc[[0, 2]]

    ID Department
0  101       B.Sc
1  102     B.Tech
2  103     M.Tech

    ID Department
0  101       B.Sc
2  103     M.Tech

In [123]:
df.query('ID == 102 | Department == "B.Sc"')

    ID Department
0  101       B.Sc
1  102     B.Tech

In [145]:
min = df['ID'].min()

df.query('ID == 102 | ID == @min')

    ID Department
0  101       B.Sc
1  102     B.Tech

In [167]:
df.query("ID == 102 | ID == "+str(df['ID'].min()))

    ID Department
0  101       B.Sc
1  102     B.Tech

In [121]:
df[(df['ID'] == 102) | (df['Department'] == 'B.Sc')]

    ID Department
0  101       B.Sc
1  102     B.Tech

In [133]:
(df['ID'].min())

101

In [137]:
df[(df['ID'] == 102) | (df['ID'].min() == 101)]

    ID Department
0  101       B.Sc
1  102     B.Tech
2  103     M.Tech